# -*- coding: utf-8 -*-

from Annotations2Sub.i18n import _

_(
    """班超字仲升，扶风平陵人，徐令彪之少子也。为人有大志，不修细节。然内孝谨，居家常执勤苦，不耻劳辱。有口辩，而涉猎书传。[1]永平五年，兄固被召诣校书郎，[2]超与母随至洛阳。家贫，常为官佣书以供养。久劳苦，尝辍业投笔叹曰：“大丈夫无它志略，犹当效傅介子、张骞立功异域，以取封侯，安能久事笔研闲乎？”[3]左右皆笑之。超曰：“小子安知壮士志哉！”其后行诣相者，曰：“祭酒，布衣诸生耳，[4]而当封侯万里之外。”超问其状。相者指曰：“生燕颔虎颈，飞而食肉，此万里侯相也。”久之，显宗问固“卿弟安在”，固对“为官写书，受直以养老母”。帝乃除超为兰台令史，[5]后坐事免官。

十六年，奉车都尉窦固出击匈奴，以超为假司马，将兵别击伊吾，战于蒲类海，[6]多斩首虏而还。固以为能，遣与从事郭恂俱使西域。

超到鄯善，[7]鄯善王广奉超礼敬甚备，后忽更踈懈。超谓其官属曰：“宁觉广礼意薄乎？此必有北虏使来，狐疑未知所从故也。明者睹未萌，况已著邪。”乃召侍胡诈之曰：“匈奴使来数日，今安在乎？”侍胡惶恐，具服其状。超乃闭侍胡，悉会其吏士三十六人，与共饮，酒酣，因激怒之曰：“卿曹与我俱在绝域，[8]欲立大功，以求富贵。今虏使到裁数日，而王广礼敬即废；如令鄯善収吾属送匈奴，骸骨长为豺狼食矣。为之柰何？”官属皆曰：“今在危亡之地，死生从司马。”超曰：“不入虎穴，不得虎子。当今之计，独有因夜以火攻虏，使彼不知我多少，必大震怖，可殄尽也。灭此虏，则鄯善破胆，功成事立矣。”众曰：“当与从事议之。”超怒曰：“吉凶决于今日。从事文俗吏，闻此必恐而谋泄，死无所名，非壮士也！”众曰：“善”。初夜，遂将吏士往奔虏营。会天大风，超令十人持鼓藏虏舍后，约曰：“见火然，皆当鸣鼓大呼。”馀人悉持兵弩夹门而伏。超乃顺风纵火，前后鼓噪。虏众惊乱，超手格杀三人，吏兵斩其使及从士三十馀级，馀众百许人悉烧死。[9]明日乃还告郭恂，恂大惊，既而色动。超知其意，举手曰：“掾虽不行，班超何心独擅之乎？”恂乃恱。超于是召鄯善王广，以虏使首示之，一国震怖。超晓告抚慰，遂纳子为质。还奏于窦固，固大喜，具上超功效，并求更选使使西域。帝壮超节，诏固曰：“吏如班超，何故不遣而更选乎？今以超为军司马，令遂前功。”超复受使，固欲益其兵，超曰：“愿将本所从三十馀人足矣。如有不虞，多益为累。”

是时于窴王广德新攻破莎车，遂雄张南道，[10]而匈奴遣使监护其国。超既西，先至于窴。广德礼意甚踈。且其俗信巫。巫言：“神怒何故欲向汉？汉使有䯄马，[11]急求取以祠我。”广德乃遣使就超请马。超密知其状，报许之，而令巫自来取马。有顷，巫至，超即斩其首以送广德，因辞让之。广德素闻超在鄯善诛灭虏使，大惶恐，即攻杀匈奴使者而降超。超重赐其王以下，因镇抚焉。

时龟兹王建为匈奴所立，倚恃虏威，据有北道，攻破疏勒，杀其王，[12]而立龟兹人兜题为疏勒王。明年春，超从闲道至疏勒。去兜题所居槃橐城九十里，逆遣吏田虑先往降之。敕虑曰：“兜题本非疏勒种，国人必不用命。若不即降，便可执之。”虑既到，兜题见虑轻弱，殊无降意。虑因其无备，遂前劫缚兜题。左右出其不意，皆惊惧奔走。虑驰报超，超即赴之，悉召疏勒将吏，说以龟兹无道之状，因立其故王兄子忠为王，[13]国人大恱。忠及官属皆请杀兜题，超不听，欲示以威信，释而遣之。疏勒由是与龟兹结怨。

十八年，帝崩。焉耆以中国大丧，[14]遂攻没都护陈睦。超孤立无援，而龟兹、姑墨数发兵攻疏勒。[15]超守盘橐城，与忠为首尾，士吏单少，拒守岁馀。肃宗初即位，以陈睦新没，恐超单危不能自立，下诏征超。超发还，疏勒举国忧恐。其都尉黎弇曰：“汉使弃我，我必复为龟兹所灭耳。诚不忍见汉使去。”因以刀自刭。超还至于窴，王侯以下皆号泣曰：“依汉使如父母，诚不可去。”互抱超马脚，不得行。超恐于窴终不听其东，又欲遂本志，乃更还疏勒。疏勒两城自超去后，复降龟兹，而与尉头连兵。[16]超捕斩反者，击破尉头，杀六百馀人，疏勒复安。

建初三年，超率疏勒、康居、于窴、拘弥兵一万人攻姑墨石城，[17]破之，斩首七百级。超欲因此叵平诸国，[18]乃上疏请兵。曰：“臣窃见先帝欲开西域，故北击匈奴，西使外国，鄯善、于窴即时向化。今拘弥、莎车、疏勒、月氏、乌孙、康居复愿归附，欲共并力破灭龟兹，平通汉道。若得龟兹，则西域未服者百分之一耳。臣伏自惟念，卒伍小吏，实愿从谷吉效命绝域，庶几张骞弃身旷野。[19]昔魏绛列国大夫，尚能和辑诸戎，[20]况臣奉大汉之威，而无鈆刀一割之用乎？[21]前世议者皆曰取三十六国，号为断匈奴右臂。[22]今西域诸国，自日之所入，莫不向化，[23]大小欣欣，贡奉不绝，唯焉耆、龟兹独未服从。臣前与官属三十六人奉使绝域，备遭艰厄。自孤守疏勒，于今五载，胡夷情数，臣颇识之。问其城郭小大，皆言‘倚汉与依天等’。以是效之，则葱领可通，[24]葱领通则龟兹可伐。今宜拜龟兹侍子白霸为其国王，以步骑数百送之，与诸国连兵，岁月之间，龟兹可禽。以夷狄攻夷狄，计之善者也。[25]臣见莎车、疏勒田地肥广，草牧饶衍，不比敦煌、鄯善间也，[26]兵可不费中国而粮食自足。且姑墨、温宿二王，特为龟兹所置，[27]既非其种，更相厌苦，其埶必有降反。若二国来降，则龟兹自破。愿下臣章，参考行事。诚有万分，死复何恨。臣超区区，特蒙神灵，窃兾未便僵仆，目见西域平定，陛下举万年之觞，[28]荐勋祖庙，布大喜于天下。”[29]书奏，帝知其功可成，议欲给兵。平陵人徐干素与超同志，上疏愿奋身佐超。五年，遂以干为假司马，将㢮刑及义从千人就超。

先是莎车以为汉兵不出，遂降于龟兹，而疏勒都尉番辰亦复反叛。[30]会徐干适至，超遂与干击番辰，大破之，斩首千馀级，多获生口。超既破番辰，欲进攻龟兹。以乌孙兵彊，宜因其力，乃上言：“乌孙大国，控弦十万，故武帝妻以公主，[31]至孝宣皇帝，卒得其用。[32]今可遣使招慰，与共合力。”帝纳之。八年，拜超为将兵长史，假鼓吹幢麾。[33]以徐干为军司马，别遣卫候李邑护送乌孙使者，赐大小昆弥以下锦帛。[34]

李邑始到于窴，而值龟兹攻疏勒，恐惧不敢前，因上书陈西域之功不可成，又盛毁超拥爱妻，抱爱子，安乐外国，无内顾心。超闻之，叹曰：“身非曾参而有三至之谗，恐见疑于当时矣。”[35]遂去其妻。帝知超忠，乃切责邑曰：“纵超拥爱妻，抱爱子，思归之士千馀人，何能尽与超同心乎？”令邑诣超受节度。诏超：“若邑任在外者，便留与从事。”超即遣邑将乌孙侍子还京师。徐干谓超曰：“邑前亲毁君，欲败西域，今何不缘诏书留之，更遣它吏送侍子乎？”超曰：“是何言之陋也！以邑毁超，故今遣之。内省不疚，何恤人言！[36]快意留之，非忠臣也。”

明年，复遣假司马和恭等四人将兵八百诣超，超因发疏勒、于窴兵击莎车。莎车阴通使疏勒王忠，啖以重利[37]忠遂反从之，西保乌即城。超乃更立其府丞成大为疏勒王，悉发其不反者以攻忠。积半岁，而康居遣精兵救之，超不能下。是时月氏新与康居婚，相亲，超乃使使多赍锦帛遗月氏王，令晓示康居王，康居王乃罢兵，执忠以归其国，乌即城遂降于超。

后三年，忠说康居王借兵，还据损中，[38]密与龟兹谋，遣使诈降于超。超内知其奸而外伪许之。忠大喜，即从轻骑诣超。超密勒兵待之，为供张设乐。[39]酒行，乃叱吏缚忠斩之。因击破其众，杀七百馀人，南道于是遂通。

明年，超发于窴诸国兵二万五千人，复击莎车。而龟兹王遣左将军发温宿、姑墨、尉头合五万人救之。超召将校及于窴王议曰：“今兵少不敌，其计莫若各散去。于窴从是而东，长史亦于此西归，可须夜鼓声而发。”阴缓所得生口。龟兹王闻之大喜，自以万骑于西界遮超，温宿王将八千骑于东界徼于窴。超知二虏已出，密召诸部勒兵，鸡鸣驰赴莎车营，胡大惊乱奔走，追斩五千馀级，大获其马畜财物。莎车遂降，龟兹等因各退散，自是威震西域。

初，月氏尝助汉击车师有功，是岁贡奉珍宝、符拔、师子，[40]因求汉公主。超拒还其使，由是怨恨。永元二年，月氏遣其副王谢将兵七万攻超。超众少，皆大恐。超譬军士曰：“月氏兵虽多，然数千里逾葱领来，非有运输，何足忧邪？但当收谷坚守，彼饥穷自降，不过数十日决矣。”谢遂前攻超，不下，又钞掠无所得。超度其粮将尽，必从龟兹求救，乃遣兵数百于东界要之。谢果遣骑赍金银珠玉以赂龟兹。超伏兵遮击，尽杀之，持其使首以示谢。谢大惊，即遣使请罪，愿得生归。超纵遣之。月氏由是大震，岁奉贡献。

明年，龟兹、姑墨、温宿皆降，乃以超为都护，徐干为长史。拜白霸为龟兹王，遣司马姚光送之。超与光共胁龟兹废其王尤利多而立白霸，使光将尤利多还诣京师。超居龟兹它乾城，徐干屯疏勒。西域唯焉耆、危须、尉犂以前没都护，怀二心，其馀悉定。

六年秋，超遂发龟兹、鄯善等八国兵合七万人，及吏士贾客千四百人讨焉耆。兵到尉犂界，而遣晓说焉耆、尉犂、危须曰：“都护来者，欲镇抚三国。即欲改过向善，宜遣大人来迎，[41]当赏赐王侯已下，事毕即还。今赐王彩五百匹。”焉耆王广遣其左将北鞬支奉牛酒迎超。[42]超诘鞬支曰：“汝虽匈奴侍子，而今秉国之权。都护自来，王不以时迎，皆汝罪也。”或谓超可便杀之。超曰：“非汝所及。此人权重于王，今未入其国而杀之，遂令自疑，设备守险，岂得到其城下哉！”于是赐而遣之。广乃与大人迎超于尉犂，奉献珍物。

焉耆国有苇桥之险，广乃绝桥，不欲令汉军入国。超更从它道厉度。[43]七月晦，到焉耆，去城二十里，营大泽中。广出不意，大恐，乃欲悉驱其人共入山保。焉耆左侯元孟先尝质京师，密遣使以事告超，超即斩之，示不信用。乃期大会诸国王，因扬声当重加赏赐，于是焉耆王广、尉犂王汎及北鞬支等三十人相率诣超。其国相腹久等十七人惧诛，[44]皆亡入海，而危须王亦不至。坐定，超怒诘广曰：“危须王何故不到？腹久等所缘逃亡？”遂叱吏士收广、汎等于陈睦故城，斩之，传首京师。因纵兵钞掠，斩首五千馀级，获生口万五千人，马畜牛羊三十馀万头，更立元孟为焉耆王。超留焉耆半岁，慰抚之。于是西域五十馀国悉皆纳质内属焉。

明年，下诏曰：“往者匈奴独擅西域，寇盗河西，永平之末，城门昼闭。先帝深愍边萌婴罗寇害，乃命将帅击右地，破白山，临蒲类，[45]取车师，城郭诸国震慑响应，遂开西域，置都护。而焉耆王舜、舜子忠独谋悖逆，恃其险隘，覆没都护，并及吏士。先帝重元元之命，惮兵役之兴，故使军司马班超安集于窴以西。超遂逾葱领，迄县度，[46]出入二十二年，莫不賔从。改立其王，而绥其人。不动中国，不烦戎士，得远夷之和，同异俗之心，而致天诛，蠲宿耻，以报将士之仇。[47]《司马法》曰：‘赏不逾月，欲人速睹为善之利也。’其封超为定远侯，邑千户。”[48]

超自以久在绝域，年老思土。十二年，上疏曰：“臣闻太公封齐，五世葬周，狐死首丘，代马依风。[49]夫周齐同在中土千里之闲，况于远处绝域，小臣能无依风首丘之思哉？蛮夷之俗，畏壮侮老。[50]臣超犬马齿歼，常恐年衰，奄忽僵仆，孤魂弃捐。昔苏武留匈奴中尚十九年，今臣幸得奉节带金银护西域，[51]如自以寿终屯部，诚无所恨，然恐后世或名臣为没西域。臣不敢望到酒泉郡，但愿生入玉门关。[52]臣老病衰困，冒死瞽言，谨遣子勇随献物入塞。[53]及臣生在，令勇目见中土。”而超妹同郡曹寿妻昭亦上书请超曰：

    妾同产兄西域都护定远侯超，幸得以微功特蒙重赏，爵列通侯，位二千石。天恩殊绝，诚非小臣所当被蒙。超之始出，志捐躯命，兾立微功，以自陈效。会陈睦之变，道路隔绝，超以一身转侧绝域，晓譬诸国，因其兵众，每有攻战，辄为先登，身被金夷，[54]不避死亡。赖蒙陛下神灵，且得延命沙漠，至今积三十年。骨肉生离，不复相识。所与相随时人士众，皆已物故。超年最长，今且七十。衰老被病，头发无黑，两手不仁，[55]耳目不聦明，扶杖乃能行。虽欲竭尽其力，以报塞天恩，迫于岁暮，犬马齿索。蛮夷之性，悖逆侮老，而超旦暮入地，久不见代，恐开奸宄之源，生逆乱之心。而卿大夫咸怀一切，莫肯远虑。如有卒暴，超之气力不能从心，便为上损国家累世之功，下弃忠臣竭力之用，诚可痛也。故超万里归诚，自陈苦急，延颈逾望，三年于今，未蒙省录。[56]

    妾窃闻古者十五受兵，六十还之，[57]亦有休息不任职也。缘陛下以至孝理天下，得万国之欢心，不遗小国之臣，况超得备侯伯之位，故敢触死为超求哀，匄超馀年。[58]一得生还，复见阙庭，使国永无劳远之虑，西域无仓卒之忧，超得长蒙文王葬骨之恩，子方哀老之惠。[59]诗云：“民亦劳止，汔可小康，惠此中国，以绥四方。”[60]超有书与妾生诀，恐不复相见。妾诚伤超以壮年竭忠孝于沙漠，疲老则便捐死于旷野，诚可哀怜。如不蒙救护，超后有一旦之变，兾幸超家得蒙赵母、卫姬先请之贷。[61]妾愚戆不知大义，触犯忌讳。

书奏，帝感其言，乃征超还。

超在西域三十一岁。十四年八月至洛阳，拜为射声校尉。超素有匈胁疾，既至，病遂加。帝遣中黄门问疾，赐医药。其年九月卒，年七十一。朝廷愍惜焉，使者吊祭，赠赗甚厚。子雄嗣。

初，超被征，以戊己校尉任尚为都护。与超交代。尚谓超曰：“君侯在外国三十馀年，而小人猥承君后，任重虑浅，宜有以诲之。”超曰：“年老失智，任君数当大位，岂班超所能及哉！必不得已，愿进愚言。塞外吏士本非孝子顺孙，皆以罪过徙补边屯。而蛮夷怀鸟兽之心，难养易败。今君性严急，水清无大鱼，察政不得下和。[62]宜荡佚简易，宽小过，緫大纲而已。”超去后，尚私谓所亲曰：“我以班君当有竒策，今所言平平耳。”尚至数年，而西域反乱，以罪被征，如超所戒。

有三子。长子雄，累迁屯骑校尉。会叛羌寇三辅，诏雄将五营兵屯长安，就拜京兆尹。雄卒，子始嗣，尚清河孝王女阴城公主。主顺帝之姑，贵骄淫乱，与嬖人居帷中，而召始入，使伏床下。始积怒，永建五年，遂拔刃杀主。帝大怒，腰斩始，同产皆弃巿。超少子勇。 """
)
